config/emacs/emacs.org
#+title: Sakomacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Usage
M-x org-bable-tangle
* Lexical Binding
Should make startup faster, taken from doom-emacs
#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src
* Default Enconding
#+begin_src emacs-lisp
  (setq utf-translate-cjk-mode nil) ; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
  (set-language-environment 'utf-8)
  (set-keyboard-coding-system 'utf-8) ; For old Carbon emacs on OS X only
  (setq locale-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-selection-coding-system
    (if (eq system-type 'windows-nt)
        'utf-16-le  ;; https://rufflewind.com/2014-07-20/pasting-unicode-in-emacs-on-windows
      'utf-8))
  (prefer-coding-system 'utf-8)
#+end_src
* Put Backup Files Somewhere else
#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
  backup-by-copying t
  version-control t     
  delete-old-versions t  
  kept-new-versions 20 
  kept-old-versions 5)
#+end_src

* EmacsClient UI
#+begin_src emacs-lisp
        (setq frame-resize-pixelwise t)
        ;; ui settings apparently go below
        (setq default-frame-alist '((font . "JetBrains Mono")
                                    '(vertical-scroll-bars . nil)
                                    '(horizontal-scroll-bars . nil)))

#+end_src
* UI 
#+begin_src emacs-lisp
    ;; UI/UX
    (setq inhibit-splash-screen t)
    ;; make it look like neovim a little
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (menu-bar-mode -1)
    ;; Line Numbers
    (column-number-mode)
    (global-display-line-numbers-mode t)
    ;; disable line numbers on some modes
    (dolist (mode '(org-mode-hook
                    term-mode-hook
                    eshell-mode-hook
                    treemacs-mode-hook
                    dashboard-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))
    ;; Bell
    (setq visible-bell t)
#+end_src
* Keymaps
#+begin_src emacs-lisp
  ;; switch buffers
  (global-set-key (kbd "C-M-j") 'counsel-switch-buffer)
  ;; instead of control-g
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  ;; repeat keybinds
  (repeat-mode)
#+end_src
* Fonts
#+begin_src emacs-lisp
  (set-face-attribute `default nil :font "JetBrains Mono" :height 130)
#+end_src
* Use-Package setup 
#+begin_src emacs-lisp
(require `package)

(setq package-archives `(("mepla" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Init package for non-linux
(unless (package-installed-p `use-package)
  (package-install `use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src
* Straight.el setup
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src
* SPEED SPEED SPEED SPEED
Most of these are taken from Doom-Emacs!
https://github.com/doomemacs/doomemacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly
Theres also Centaur Emacs
https://github.com/seagle0128/.emacs.d
** Avoid Garbage Collection at startup
#+begin_src emacs-lisp
  (use-package gcmh
    :init
    (gcmh-mode 1))
  (add-hook 'emacs-startup-hook (gcmh-mode 1))
#+end_src
** Move Garbage collection further back
#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum)
#+end_src
** Unset file-name-handler-alist temporarily
#+begin_src emacs-lisp
(defvar sakomacs--file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;; Alternatively, restore it even later:
(add-hook 'emacs-startup-hook
  (lambda ()
    (setq file-name-handler-alist sakomacs--file-name-handler-alist)))
#+end_src

* Packages
** Command Log Mode
#+begin_src emacs-lisp
      (use-package command-log-mode
        :straight t
        )
#+end_src
** Command Autocompletion Packages 
#+begin_src emacs-lisp
  ;; better search
  (use-package swiper
        :straight t
    )
  ;; better commands
  (use-package counsel
      :straight t
    )
  ;; autocompletion on commands (?)
  (use-package ivy
    :diminish
    :straight t
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)	
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :demand
    :config
    (ivy-mode 1))
  ;; better ivy autocompletion
  (use-package ivy-rich
    :straight t
    :init
    (ivy-rich-mode 1))

  ;; counsel M+X
  (use-package counsel
    :straight t
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-inital-inputs-alist nil))
#+end_src
** Custom Themes
#+begin_src emacs-lisp
  (use-package doom-themes
  :straight t
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; load the theme
  (load-theme 'doom-peacock t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config))
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;;(doom-themes-neotree-config)
  ;; or for treemacs users
  ;;(setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;;(doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  ;;(doom-themes-org-config))
#+end_src
** Nerd-Fonts (All of the Icons doesnt work for me)
#+begin_src emacs-lisp
(use-package nerd-icons
  :straight t
  :custom
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  (nerd-icons-font-family "JetBrainsMono NF")
  )
#+end_src
** Rainbow Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :straight t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Keybinding autocompletion
#+begin_src emacs-lisp
  (use-package which-key
    :straight t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src
** Custom Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :straight t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 30)))
#+end_src
** Better help menu
#+begin_src emacs-lisp
(use-package helpful
  :ensure t
  :straight t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function ] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src
** General Leader Key
#+begin_src emacs-lisp
  (use-package general
    :straight t
    :config
    (general-create-definer sakomacs/leader-keys
      :keymaps `(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (sakomacs/leader-keys
      "t" `(:ignore t :which-key "toggles")
      "tt" `(counsel-load-theme :which-key "choose theme")
      "e" `(:ignore e :which-key "explorer")
      "ee" `(treemacs :which-key "treemacs")
      "p" `(:ignore p :which-key "projects")
      "pp" `(projectile-switch-project :which-key "open project")
      "pk" `(projectile-kill-buffers :which-key "close project")
      "o" `(:ignore o :which-key "org")
      "oa" `(org-agenda :which-key "agenda")
      "g" `(:ignore g :which-key "git")
      "gs" `(magit-status :which-key "status")))
#+end_src 
** Emacs-Dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :straight t
    :config
    (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
    ;; Configuration of Dashboard
    (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
    (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
    ;; Set the title
    (setq dashboard-banner-logo-title "Emacs is vscode for nerds")
    ;; Set the banner
    (setq dashboard-startup-banner 'official)
    ;; center everything 
    (setq dashboard-center-content t)
    ;; jump thing
    (setq dashboard-show-shortcuts nil)
    (setq dashboard-items '((projects . 5)
                            (agenda . 5)))
    (setq dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name)
    (setq dashboard-footer-messages '("I think I have Emacs pinky!"))
    (dashboard-setup-startup-hook))
#+end_src
